int[] myArray = new int[n]; \\ дефиниране на масив, n - брой на елементите в него (дължина)

int[] myArray = { 1, 2, 3, 4, 5, 6... }; \\ дефиниране на масив с определени стойности

0, 1, 2, 3, 4, 5..... (n-1) \\ n-1 e последен елемент в масива от n на брой елемента

myArray[index] = 100; \\ в този пример присвояваме стойност 100 на даден index

int[] myArray = new int[6]; \\ пример, в който дефинираме масив от 6 елемента от тип int { 0, 0, 0, 0, 0, 0 }
myArray[1] = 1;              \\ променяме елементите на 1 - ви и 5 - ти индекс 
myArray[5] = 5;               \\ след промяната масивът изглежда по следния начин { 1, 0, 0, 0, 5, 0 }

int[] array = new int[6];

for (int i = 0; i < array.Length; i++) \\ цялостно обхождане на масив
{
    array[i] = i;
}